#include "i2c.h"
#include <intrinsics.h>
#include <iostm8s103f3.h>
#include <stm8s_type.h>
                    
//******************************************************************************
// Инициализация                            
//******************************************************************************                                   
void ds3231_init(){
  i2c_init();
  i2c_start();                          // запуск i2c
  i2c_send_adress(0xD0);                // передача адреса устройства, режим записи
  i2c_send_data(0x0E);                  // передача адреса памяти 
  i2c_send_data(0x20);                  // запустить преобразование температуры и выход на 1 Гц
  i2c_send_data(0x08);                  // разрешить выход 32 кГц
  i2c_stop();                           // остановка i2c
}

//******************************************************************************
// Чтение времени
//******************************************************************************  
void ds3231_read_time(u8 * data){
    u8 sec, min, hour;
    
    i2c_init();
    i2c_start();                          // запуск i2c
    i2c_send_adress(0xD0);                // передача адреса устройства, режим записи
    i2c_send_data(0x00);                  // передача адреса памяти 
    i2c_stop();                           // остановка i2c
 
    i2c_start();                          // запуск i2c
    i2c_send_adress(0xD1);                // передача адреса устройства,  режим чтения
    i2c_get_data(data++,0);               // чтение секунд, ACK
    i2c_get_data(data++,0);               // чтение минут, ACK
    i2c_get_data(data++,0);               // чтение часов, ACK
    i2c_get_data(data++,0);               // чтение день недели, ACK
    i2c_get_data(data++,0);               // чтение число, ACK
    i2c_get_data(data++,0);               // чтение месяц, ACK
    i2c_get_data(data++,1);               // чтение год, NACK
    i2c_stop();                           // остановка i2c
}

//******************************************************************************
// Запись времени
//****************************************************************************** 
void ds3231_write_time(u8 * data){
 
    i2c_init();
    i2c_start();                          // запуск i2c
    i2c_send_adress(0xD0);                // передача адреса устройства, режим записи
    i2c_send_data(0x00);                  // передача адреса памяти 
    i2c_send_data(*data++);               // передача адреса памяти 
    i2c_send_data(*data++);               // 0x00 секунды
    i2c_send_data(*data++);               // 0x01 минуты
    i2c_send_data(*data++);               // 0x02 часы
    i2c_send_data(*data++);               // 0x03 день недели
    i2c_send_data(*data++);               // 0x04 число
    i2c_send_data(*data++);               // 0x05 месяц
    i2c_send_data(*data++);               // 0x06 год
    i2c_stop();                           // остановка i2c
}